using System.Collections.Generic;

namespace FliGen.Persistence.Helper.InitialFill
{
    public static class InitialFillData
    {
        public static readonly List<string> Players = new List<string>
        {
            {"Матюнин Валентин 7.2"},
            {"Волчков Вячеслав 7.1"},
            {"Никитин Евгений 7.1"},
            {"Алтухов Антон 7.2"},
            {"Виноходов Игорь 7.3"},
            {"Галицкий Вячеслав 7.2"},
            {"Косенков Олег 7.5"},
            {"Мухин Иван 7.3"},
            {"Попов Александр 7.4"},
            {"Попов Артем 7.4"},
            {"Растаев Дмитрий 7.4"},
            {"Филинов Павел 7.3"},
            {"Масюк Родион 7.3"},
            {"Дубцов Максим 7.2"},
            {"Ахтямов Руслан 6.9"},
            {"Яшин Анатолий 7.1"},
            {"Зырянов Егор 7.1"},
            {"Сгибнев Андрей 7.2"},
            {"Ляшук Алексей 6.5"},
            {"Ларичкин Алексей 7.0"},
            {"Абушахмин Роман 7.4"},
            {"Абрамов Дмитрий 7.4"},
            {"Алтухов Илья 7.4"},
            {"Аль-Махлай Виталий 7.4"},
            {"Антипов Илья 7.4"},
            {"Арабей Евгений 7.4"},
            {"Аскаров Ришат 7.4"},
            {"Богачев Николай 7.4"},
            {"Биляуэр Константин 7.4"},
            {"Гриднев Виталий 7.4"},
            {"Гугняев Антон 7.4"},
            {"Гусев Павел 7.4"},
            {"Демидов Дмитрий 7.4"},
            {"Дорожко Никита 7.4"},
            {"Дубенский Андрей 7.4"},
            {"Захаревич Дмитрий 7.4"},
            {"Егоров Роман 7.4"},
            {"Добряков Аскар 7.4"},
            {"Дутлов Леонид 7.4"},
            {"Казанцев Павел 7.4"},
            {"Зайцев Сергей 7.4"},
            {"Захаревич Олег 7.4"},
            {"Иванов Александр 7.4"},
            {"Иванов Павел 7.2"},
            {"Камзалаков Иван 7.1"},
            {"Ларионов Олег 7.9"},
            {"Кувшинов Максим 7.1"},
            {"Кувшинов Роман 7.2"},
            {"Кухахметов Марат 7.2"},
            {"Лаврега Игорь 7.1"}
        }; // 50 players

        public static readonly List<string> Leagues = new List<string> {"FLI", "FLIHockey"};

        public static readonly List<(string, string)> TeamCombinations = new List<(string, string)>
        {
            ("Лазурные", "Красные"),
            ("Красные", "Лазурные")
        };

        public static readonly List<(string, string)> SeasonDates = new List<(string, string)>
        {
            ("2015-01-01", "2015-12-31"),
            ("2016-01-01", "2016-12-31"),
            ("2017-01-01", "2017-12-31"),
            ("2018-01-01", "2018-12-31"),
            ("2019-01-01", "2019-12-31"),
            ("2020-01-01", "2020-12-31")
        };

        public const int HockeyLeaguePlayers = 50;
        public const int FootballLeaguePlayers = 50;
        public const int ToursInSeasonCount = 50;
        public const int MaxGoals = 16;
        public const int TeamPlayersCount = 8;
    }
}